[
  {"joke": "কেন কম্পিউটার ঠান্ডা থাকে? কারণ এতে অনেক Fan আছে!"},
  {"joke": "কেন Python প্রোগ্রামার ডার্ক মোড পছন্দ করে? কারণ Light এ Bugs আসে।"},
  {"joke": "কেন ক্রিকেট খেলোয়াড় ব্যর্থ হল? কারণ সে Ball Catch করতে ভুলে গেল।"},
  {"joke": "কেন বিড়ালরা কম্পিউটার পছন্দ করে? কারণ তারা Mouse ভালোবাসে।"},
  {"joke": "কেন ভ্যালেট সবসময় শান্ত থাকে? কারণ সে সবাইকে Park করে।"},
  {"joke": "কেন টেনিস খেলোয়াড় বিয়ে করে না? কারণ Love তাদের কাছে কিছু নয়।"},
  {"joke": "কেন শিক্ষার্থী ঘুমিয়ে পড়ল? কারণ সে Notebook খোলার চেষ্টা করছিল।"},
  {"joke": "কেন মাছ স্কুলে যায়? কারণ তারা ভালো Swimming শিখতে চায়।"},
  {"joke": "কেন চিংড়ি Party পছন্দ করে না? কারণ অনেক Sauce থাকে।"},
  {"joke": "কেন বাস্কেটবল খেলোয়াড় Bench এ বসে থাকে? Rebound নিতে।"},
  {"joke": "কেন বাঘ কম্পিউটার পছন্দ করে না? কারণ Mouse খুব ছোট।"},
  {"joke": "কেন গলফার দুই জোড়া প্যান্ট নিয়ে চলে? In case hole in one।"},
  {"joke": "কেন শিক্ষার্থী বই পড়তে ক্লান্ত? কারণ Page বেশি।"},
  {"joke": "কেন কুকুর কম্পিউটার পছন্দ করে? কারণ সে Mouse পায়।"},
  {"joke": "কেন সাঁতারু Pool–এ সাবান নিয়ে আসে? Clean করতে।"},
  {"joke": "কেন টমেটো লাল হয়ে যায়? কারণ সে Salad দেখে লজ্জিত।"},
  {"joke": "কেন Python কোড লজ্জিত হয়? Naked variable দেখেছে।"},
  {"joke": "কেন হকি খেলোয়াড় জেলে যায়? কারণ সে Puck শট করল।"},
  {"joke": "কেন ব্যাঙ ভালো গান করে না? কারণ তার Voice Croak।"},
  {"joke": "কেন রানার gym–এ যায়? Leg up নিতে।"},
  {"joke": "কেন কুকুর ব্যায়াম করতে ভালোবাসে? Dog Yoga করতে।"},
  {"joke": "কেন কম্পিউটার গরম হয়? Too many Process চলছে।"},
  {"joke": "কেন Python Dev Café যায়? Exception Handle করতে।"},
  {"joke": "কেন শিশু School পছন্দ করে না? Too much Homework।"},
  {"joke": "কেন গলফার ল্যাডার এনেছে? High swing reach করতে।"},
  {"joke": "কেন চিংড়ি সাঁতার ভালো করে না? Too slippery।"},
  {"joke": "কেন বিড়াল Party পছন্দ করে না? Too many mice।"},
  {"joke": "কেন মুরগি Basketball খেলে না? Too many eggs!"},
  {"joke": "কেন Python Dev Dorm এ থাকে? Sleep Handle করতে।"},
  {"joke": "কেন স্ট্রিং ভয় পায়? Split হতে।"},
  {"joke": "কেন Monkey School যায়? Tree Learning করতে।"},
  {"joke": "কেন বাস্কেটবল খেলোয়াড় জেলে যায়? Too much Traveling।"},
  {"joke": "কেন শিক্ষার্থী Notebook ভিজিয়ে দেয়? Tears drop হয়।"},
  {"joke": "কেন মাছ কম্পিউটার পছন্দ করে না? Too many Net।"},
  {"joke": "কেন সাপ কাঁদে? Too many hiss।"},
  {"joke": "কেন Python List দুঃখিত? Lost tuple of friends।"},
  {"joke": "কেন ভলিবল খেলোয়াড় Rope এনেছে? Set ঠিক করতে।"},
  {"joke": "কেন বিড়াল Music পছন্দ করে? Purrfect Rhythm।"},
  {"joke": "কেন গলফার দুই হ্যাট পরে? Hole in one–এর জন্য।"},
  {"joke": "কেন রানার লেজু পার্কে যায়? Lap counter করতে।"},
  {"joke": "কেন Python ডেভেলপার Elevator ভালোবাসে? Floor-wise Exception।"},
  {"joke": "কেন মুরগি ব্যায়াম করে না? Too many wings।"},
  {"joke": "কেন শিক্ষক chalk নিয়ে হাসে? Because it’s too punny।"},
  {"joke": "কেন সাঁতারু Lap টাইম নোট করে? Speed improve করতে।"},
  {"joke": "কেন Python কোড blush করে? Private key দেখেছে।"},
  {"joke": "কেন কম্পিউটার Gym যায়? Memory Stretch করতে।"},
  {"joke": "কেন Python কোড Night–এ ঘুমায়? Loop Crash avoid করতে।"},
  {"joke": "কেন বিড়াল Window পছন্দ করে? Sun Catch করতে।"},
  {"joke": "কেন হকি রিংক ভেজা? Too many dribbles।"},
  {"joke": "কেন Monkey Banana খায়? Energy boost।"},
  {"joke": "কেন Python ডেভেলপার Party যায়? Unexpected guest handle করতে।"},
  {"joke": "কেন মাছ স্কুলে যায়? Better swimming শিখতে।"},
  {"joke": "কেন রানার Track পছন্দ করে? Straight path।"},
  {"joke": "কেন Python ছাত্র Dorm এ থাকে? Stack unwind করতে।"},
  {"joke": "কেন গলফার পেন্সিল এনেছে? Fairway draw করতে।"},
  {"joke": "কেন সাঁতারু Pool–এ paper এনেছে? Lane draw করতে।"},
  {"joke": "কেন মুরগি Eggs hide করে? Too many kids।"},
  {"joke": "কেন শিক্ষক Exam ভালোবাসে? Students Stress দেখতে।"},
  {"joke": "কেন Python কোড nervous? Too many pop operations।"},
  {"joke": "কেন Rabbit Speed ভালো? Carrot chase।"},
  {"joke": "কেন Tiger Jungle ভালোবাসে? Free roam করতে।"},
  {"joke": "কেন Python Library ভালোবাসে? Life সহজ করতে।"},
  {"joke": "কেন Monkey School যায়? Tree Learn করতে।"},
  {"joke": "কেন গলফার Gym যায়? Swing Strengthen করতে।"},
  {"joke": "কেন Fish Pool–এ যায়? Swim Practice করতে।"},
  {"joke": "কেন ব্যাঙ Music বাজায়? Croak Harmony।"},
  {"joke": "কেন Python Student Busy থাকে? Too many Functions।"},
  {"joke": "কেন Cat Laptop পছন্দ করে? Mouse catch করতে।"},
  {"joke": "কেন Rabbit Race খায়? Carrot prize জন্য।"},
  {"joke": "কেন Python Code blush করে? Naked Variable দেখল।"},
  {"joke": "কেন Tiger Gym যায়? Muscle Build করতে।"},
  {"joke": "কেন Fish School যায়? Net থেকে বাঁচতে।"},
  {"joke": "কেন Python Dorm tidy থাকে? Thread manage করতে।"},
  {"joke": "কেন Monkey Computer পছন্দ করে? Banana handle করতে।"},
  {"joke": "কেন Rabbit Gym যায়? Jump Improve করতে।"},
  {"joke": "কেন Python Dorm clean থাকে? Exception Avoid করতে।"},
  {"joke": "কেন Fish Swim fast? Predator avoid করতে।"},
  {"joke": "কেন Tiger Coffee পছন্দ করে? Stay Awake করতে।"},
  {"joke": "কেন Python Student Notebook ব্যবহার করে? Notes jot করতে।"},
  {"joke": "কেন Cat Nap পছন্দ করে? Sleep Catch করতে।"},
  {"joke": "কেন Rabbit Race выигрывает? Fast Foot।"},
  {"joke": "কেন Python Developer Dance করে? Code Rhythm match করতে।"},
  {"joke": "কেন Fish Pool–এ আছে? Lane improve করতে।"},
  {"joke": "কেন Monkey Party পছন্দ করে না? Banana shortage।"},
  {"joke": "কেন Teacher Pun ভালোবাসে? Students হাসে।"},
  {"joke": "কেন Rabbit Carrots খায়? Energy Boost করতে।"},
  {"joke": "কেন Python Code Party যায়? Unexpected Exception Handle করতে।"},
  {"joke": "কেন Cat Window ভালোবাসে? Sun Catch করতে।"},
  {"joke": "কেন Tiger Jungle ভালোবাসে? Free roam করতে।"},
  {"joke": "কেন Rabbit Gym ভালোবাসে? Jump Boost।"},
  {"joke": "কেন Fish Pool পছন্দ করে? Lane practice।"},
  {"joke": "কেন Python Student Dormে থাকে? Stack unwind করতে।"},
  {"joke": "কেন Monkey School ভালোবাসে? Tree Learn করতে।"},
  {"joke": "কেন Python Dev Coffee পছন্দ করে? Exception Handle করতে।"},
  {"joke": "কেন Teacher Exam ভালোবাসে? Stress test দেখতে।"},
  {"joke": "কেন Rabbit Race জেতে চায়? Carrot prize।"},
  {"joke": "কেন Python Code blush করে? Private Key দেখল।"}
]
