[
  {"joke": "কেন ফুটবল খেলোয়াড় স্ট্রিং এনেছিল? যাতে সে স্কোর টাই করতে পারে!"},
  {"joke": "কেন বাস্কেটবল দল সবসময় সমস্যায় পড়ে? কারণ তারা Traveling করে!"},
  {"joke": "কেন গলফার দুই জোড়া প্যান্ট এনেছিল? যদি Hole in one হয়ে যায়।"},
  {"joke": "কেন টেনিস খেলোয়াড় কখনো বিয়ে করে না? কারণ Love তাদের কাছে কিছু নয়।"},
  {"joke": "কেন বেসবল দল সবসময় লকার রুমে থাকে? কারণ তারা একটি Pitcher প্রয়োজন।"},
  {"joke": "কেন ফুটবল কোচ ব্যাংকে গেল? তার Quarterback নিতে।"},
  {"joke": "কেন স্টেডিয়াম এত কুল? এখানে Fans ভরা ছিল!"},
  {"joke": "কেন সাঁতারু সাবান এনেছিল? Pool–এ clean করতে!"},
  {"joke": "কেন হকি খেলোয়াড় জেলে গেল? কারণ সে puck শট করল!"},
  {"joke": "কেন বাস্কেটবল খেলোয়াড় পার্টিতে গেল? He wanted to shoot some hoops।"},
  {"joke": "কেন ফুটবল বল দল ছেড়ে গেল? কারণ তাকে বারবার kick করা হয়েছিল।"},
  {"joke": "কেন গলফার Extra shirt নিয়ে চলে? যদি hole in one হয়।"},
  {"joke": "কেন ভলিবল দল Bakery–এ গেল? বেশি Turnover প্রয়োজন।"},
  {"joke": "কেন বেসবল খেলোয়াড় ল্যাডার এনেছিল? High fly ball catch করতে।"},
  {"joke": "কেন ফুটবল দল আর্ট ক্লাসে গেল? Fouls আঁকতে।"},
  {"joke": "কেন সাইক্লিস্ট স্কুলে গেল? Cycle-logical thinking improve করতে।"},
  {"joke": "কেন ট্র্যাক রানার সবসময় ক্লান্ত? কারণ সে running on empty।"},
  {"joke": "কেন ফুটবল কোচ লাইব্রেরিতে গেল? আরো plays নিতে।"},
  {"joke": "কেন বাস্কেটবল খেলোয়াড় বেঞ্চে বসেছিল? Rebound করতে।"},
  {"joke": "কেন বেসবল কোচ Detective নিয়েছিল? Missing players খুঁজতে।"},
  {"joke": "কেন সাঁতারু Secret agent হতে পারে? কারণ সে dive করতে জানে।"},
  {"joke": "কেন ফুটবল খেলোয়াড় ব্যাংকে গেল? তার goalie check করতে।"},
  {"joke": "কেন টেনিস দল সবসময় শান্ত থাকে? কারণ তারা serve handle করতে জানে।"},
  {"joke": "কেন Referee স্কুলে গেল? Shots call করতে।"},
  {"joke": "কেন ফুটবল খেলোয়াড় স্ট্রিং এনেছিল? স্কোর tie করতে।"},
  {"joke": "কেন বেসবল খেলোয়াড় পেন্সিল এনেছিল? Line drive draw করতে।"},
  {"joke": "কেন জিমনাস্ট Math–এ ভালো? Flip করতে জানে।"},
  {"joke": "কেন ফুটবল বল থেরাপি করতে গেল? Too many kicks!"},
  {"joke": "কেন কোচ Bakery–এ গেল? Turnover নিতে।"},
  {"joke": "কেন বাস্কেটবল খেলোয়াড় notebook এনেছিল? Rebound notes নিতে।"},
  {"joke": "কেন সাঁতারু dessert খায় না? Already full of strokes।"},
  {"joke": "কেন বেসবল ফিল্ড সবসময় ভেজা? Players dribbling বেশি।"},
  {"joke": "কেন গলফার দুই টুপি পরে? Hole in one–এর জন্য।"},
  {"joke": "কেন ফুটবল খেলোয়াড় রশি এনেছিল? Game tie করতে।"},
  {"joke": "কেন ফুটবল দল ব্যাংকে গেল? Quarterback নিতে।"},
  {"joke": "কেন রানার পেন্সিল এনেছিল? Finish line draw করতে।"},
  {"joke": "কেন হকি দল Bakery–এ গেল? আরও Turnover নিতে।"},
  {"joke": "কেন ভলিবল খেলোয়াড় notebook এনেছিল? Set notes রাখতে।"},
  {"joke": "কেন বেসবল কোচ জেলে গেল? Stealing bases।"},
  {"joke": "কেন ফুটবল খেলোয়াড় Dentist–এ গেল? Teeth kicked।"},
  {"joke": "কেন স্টেডিয়াম গরম? Fans চলে গেছে।"},
  {"joke": "কেন বাস্কেটবল খেলোয়াড় জেলে গেল? Too much traveling।"},
  {"joke": "কেন সাঁতারু Bad joke পছন্দ করে না? Splash handle করতে পারে না।"},
  {"joke": "কেন রানার স্ট্রিং এনেছিল? Race tie করতে।"},
  {"joke": "কেন গলফার পেন্সিল এনেছিল? Fairway draw করতে।"},
  {"joke": "কেন টেনিস খেলোয়াড় ল্যাডার এনেছিল? Top spin reach করতে।"},
  {"joke": "কেন ফুটবল মাঠ সবসময় ভেজা? Players dribbling বেশি।"},
  {"joke": "কেন ভলিবল খেলোয়াড় beach ভালোবাসে? Sand sets বেশি।"},
  {"joke": "কেন কোচ পেন্সিল এনেছিল? Play draw করতে।"},
  {"joke": "কেন বেসবল খেলোয়াড় broom এনেছিল? Sweep the bases।"},
  {"joke": "কেন ফুটবল খেলোয়াড় স্কুলে গেল? Goal setting improve করতে।"},
  {"joke": "কেন সাঁতারু map এনেছিল? Lanes navigate করতে।"},
  {"joke": "কেন বাস্কেটবল খেলোয়াড় ঘড়িতে বসেছিল? Time shoot করতে।"},
  {"joke": "কেন টেনিস খেলোয়াড় notebook এনেছিল? Serve up notes।"},
  {"joke": "কেন ফুটবল কোচ Upset ছিল? Too many penalties।"},
  {"joke": "কেন রানার gym–এ গেল? Leg up নিতে।"},
  {"joke": "কেন বেসবল খেলোয়াড় string এনেছিল? Bases tie করতে।"},
  {"joke": "কেন ভলিবল খেলোয়াড় string এনেছিল? Set ঠিক করতে।"},
  {"joke": "কেন টেনিস খেলোয়াড় পেন্সিল এনেছিল? Score রাখতে।"},
  {"joke": "কেন ফুটবল খেলোয়াড় ব্যাংকে গেল? Goalie check করতে।"},
  {"joke": "কেন বাস্কেটবল খেলোয়াড় ল্যাডার এনেছিল? New heights reach করতে।"},
  {"joke": "কেন হকি rink ভেজা? Too many dribbles।"},
  {"joke": "কেন সাঁতারু notebook এনেছিল? Strokes track করতে।"},
  {"joke": "কেন টেনিস খেলোয়াড় আর্ট ক্লাসে গেল? Serve শিখতে।"},
  {"joke": "কেন ভলিবল খেলোয়াড় rope এনেছিল? Set ঠিক করতে।"},
  {"joke": "কেন ফুটবল মাঠ slippery? Too many goals।"},
  {"joke": "কেন বাস্কেটবল খেলোয়াড় পেন্সিল এনেছিল? Foul draw করতে।"},
  {"joke": "কেন ফুটবল খেলোয়াড় string এনেছিল? Game tie করতে।"},
  {"joke": "কেন বেসবল খেলোয়াড় আর্ট ক্লাসে গেল? Curves improve করতে।"},
  {"joke": "কেন রানার string এনেছিল? Finish line tie করতে।"},
  {"joke": "কেন গলফার string এনেছিল? Swing tie করতে।"},
  {"joke": "কেন হকি খেলোয়াড় Bakery–এ গেল? Turnovers নিতে।"},
  {"joke": "কেন ভলিবল খেলোয়াড় string এনেছিল? Sets tie করতে।"},
  {"joke": "কেন টেনিস খেলোয়াড় পেন্সিল এনেছিল? Score রাখতে।"},
  {"joke": "কেন ফুটবল খেলোয়াড় ব্যাংকে গেল? Goalie check করতে।"},
  {"joke": "কেন বাস্কেটবল খেলোয়াড় ল্যাডার এনেছিল? Reach new heights।"}
]
