[
  {"joke": "Why did the soccer player bring string to the game? So he could tie the score!"},
  {"joke": "Why was the basketball team always in trouble? They kept traveling!"},
  {"joke": "Why did the golfer bring two pairs of pants? In case he got a hole in one."},
  {"joke": "Why do tennis players never get married? Love means nothing to them."},
  {"joke": "Why was the baseball team always in the locker room? Because they needed a pitcher."},
  {"joke": "Why did the football coach go to the bank? To get his quarterback."},
  {"joke": "Why was the stadium so cool? It was full of fans!"},
  {"joke": "Why did the swimmer bring a bar of soap? To clean up in the pool!"},
  {"joke": "Why did the hockey player go to jail? Because he shot the puck!"},
  {"joke": "Why did the basketball player go to the party? He wanted to shoot some hoops."},
  {"joke": "Why did the soccer ball quit the team? It was tired of being kicked around."},
  {"joke": "Why do golfers carry extra shirts? In case they get a hole in one."},
  {"joke": "Why did the volleyball team go to the bakery? They needed more turnovers."},
  {"joke": "Why did the baseball player bring a ladder? He wanted to catch a high fly ball."},
  {"joke": "Why did the soccer team go to art class? To learn how to draw fouls."},
  {"joke": "Why did the cyclist go to school? To improve his cycle-logical thinking."},
  {"joke": "Why was the track runner always tired? He was running on empty."},
  {"joke": "Why did the football coach go to the library? To get more plays."},
  {"joke": "Why did the basketball player sit on the bench? He wanted to rebound."},
  {"joke": "Why did the baseball coach hire a detective? To catch the missing players."},
  {"joke": "Why do swimmers make great secret agents? They know how to dive into action."},
  {"joke": "Why did the soccer player go to the bank? To get his goalie checked."},
  {"joke": "Why was the tennis team always calm? They knew how to handle the serve."},
  {"joke": "Why did the referee go to school? To learn how to call the shots."},
  {"joke": "Why did the football player bring string? To tie up the score."},
  {"joke": "Why did the baseball player bring a pencil? To draw a line drive."},
  {"joke": "Why was the gymnast so good at math? She knew how to flip numbers."},
  {"joke": "Why did the soccer ball go to therapy? It had too many kicks to handle."},
  {"joke": "Why did the coach go to the bakery? For turnovers, of course."},
  {"joke": "Why did the basketball player bring a notebook? To work on his rebound notes."},
  {"joke": "Why did the swimmer refuse dessert? He was already full of strokes."},
  {"joke": "Why was the baseball field always wet? The players kept dribbling."},
  {"joke": "Why did the golfer wear two hats? In case he got a hole in one."},
  {"joke": "Why did the soccer player bring a rope? To tie the game."},
  {"joke": "Why did the football team go to the bank? To get their quarterback."},
  {"joke": "Why did the runner bring a pencil? To draw a finish line."},
  {"joke": "Why did the hockey team go to the bakery? They needed more turnovers."},
  {"joke": "Why did the volleyball player bring a notebook? To set some notes."},
  {"joke": "Why did the baseball coach go to jail? He was caught stealing bases."},
  {"joke": "Why did the soccer player go to the dentist? To get his teeth kicked."},
  {"joke": "Why was the football stadium so hot? Because all the fans left."},
  {"joke": "Why did the basketball player go to jail? For traveling too much."},
  {"joke": "Why do swimmers avoid bad jokes? They can’t handle the splash."},
  {"joke": "Why did the runner bring string? To tie up the race."},
  {"joke": "Why did the golfer bring a pencil? To draw a fairway."},
  {"joke": "Why did the tennis player bring a ladder? To reach the top spin."},
  {"joke": "Why was the soccer field always wet? The players dribbled all over it."},
  {"joke": "Why do volleyball players love the beach? It’s full of sand sets."},
  {"joke": "Why did the coach bring a pencil? To draw up the plays."},
  {"joke": "Why did the baseball player bring a broom? To sweep the bases."},
  {"joke": "Why did the football player go to school? To improve his goal setting."},
  {"joke": "Why did the swimmer bring a map? To navigate the lanes."},
  {"joke": "Why did the basketball player sit on the clock? To shoot for time."},
  {"joke": "Why did the tennis player bring a notebook? To serve up some notes."},
  {"joke": "Why was the soccer coach upset? Too many penalties."},
  {"joke": "Why did the runner go to the gym? To get a leg up on the competition."},
  {"joke": "Why did the baseball player bring string? To tie up the bases."},
  {"joke": "Why did the football player go to the bank? To get a quarterback."},
  {"joke": "Why did the volleyball player bring string? To set it up right."},
  {"joke": "Why was the tennis player cold? Because he forgot his warm-ups."},
  {"joke": "Why did the soccer ball go to school? To improve its kicks."},
  {"joke": "Why did the golfer wear two pairs of pants? In case he got a hole in one."},
  {"joke": "Why did the baseball player bring a ladder? To catch high flies."},
  {"joke": "Why did the hockey player bring string? To tie up the score."},
  {"joke": "Why was the football coach angry? Too many fumbles."},
  {"joke": "Why did the basketball player go to art class? To learn how to draw fouls."},
  {"joke": "Why did the swimmer bring a pencil? To draw a lane."},
  {"joke": "Why did the soccer player go to the library? To improve his goal setting."},
  {"joke": "Why did the tennis player bring a backpack? To carry his rackets."},
  {"joke": "Why did the volleyball player go to school? To improve his sets."},
  {"joke": "Why did the baseball player go to school? To get his curves straight."},
  {"joke": "Why did the football player bring a ladder? To reach higher goals."},
  {"joke": "Why did the runner bring string? To tie the race."},
  {"joke": "Why did the hockey player go to the dentist? Too many teeth in the puck."},
  {"joke": "Why was the basketball coach angry? His team kept dribbling too much."},
  {"joke": "Why did the soccer player bring a notebook? To keep track of goals."},
  {"joke": "Why did the football player go to school? To improve his kicking skills."},
  {"joke": "Why did the swimmer bring string? To keep track of laps."},
  {"joke": "Why did the baseball player bring a rope? To tie the bases."},
  {"joke": "Why did the tennis player bring string? To keep his racket tight."},
  {"joke": "Why was the volleyball court so messy? Too many spikes."},
  {"joke": "Why did the soccer ball go to the bar? To get kicked around."},
  {"joke": "Why did the runner bring a notebook? To record his laps."},
  {"joke": "Why did the basketball player bring string? To tie the score."},
  {"joke": "Why did the football coach bring a ladder? To reach higher plays."},
  {"joke": "Why did the baseball team go to the bakery? To get turnovers."},
  {"joke": "Why did the soccer player bring a ladder? To reach new goals."},
  {"joke": "Why was the hockey rink wet? Too many dribbles."},
  {"joke": "Why did the swimmer bring a notebook? To track strokes."},
  {"joke": "Why did the tennis player go to art class? To learn to serve."},
  {"joke": "Why did the volleyball player bring a rope? To set up properly."},
  {"joke": "Why was the soccer field slippery? Too many goals."},
  {"joke": "Why did the basketball player bring a pencil? To draw a foul."},
  {"joke": "Why did the football player bring string? To tie the game."},
  {"joke": "Why did the baseball player go to art class? To improve his curves."},
  {"joke": "Why did the runner bring string? To tie the finish line."},
  {"joke": "Why did the golfer bring string? To tie his swings together."},
  {"joke": "Why did the hockey player go to the bakery? To get more turnovers."},
  {"joke": "Why did the volleyball player bring string? To tie the sets."},
  {"joke": "Why did the tennis player bring a pencil? To keep score."},
  {"joke": "Why did the soccer player go to the bank? To get his goalie checked."},
  {"joke": "Why did the basketball player bring a ladder? To reach new heights."}
]
